jmeter/html-report/statistics.json
{
  "Create Trip" : {
    "transaction" : "Create Trip",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 180.8,
    "medianResTime" : 189.0,
    "minResTime" : 155.0,
    "maxResTime" : 196.0,
    "pct1ResTime" : 196.0,
    "pct2ResTime" : 196.0,
    "pct3ResTime" : 196.0,
    "throughput" : 15.625,
    "receivedKBytesPerSec" : 15.5487060546875,
    "sentKBytesPerSec" : 3.4332275390625
  },
  "Accept Trip" : {
    "transaction" : "Accept Trip",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 266.0,
    "medianResTime" : 270.0,
    "minResTime" : 226.0,
    "maxResTime" : 301.0,
    "pct1ResTime" : 301.0,
    "pct2ResTime" : 301.0,
    "pct3ResTime" : 301.0,
    "throughput" : 12.755102040816327,
    "receivedKBytesPerSec" : 12.692821269132653,
    "sentKBytesPerSec" : 2.678073182397959
  },
  "Location Trip" : {
    "transaction" : "Location Trip",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 274.4,
    "medianResTime" : 275.0,
    "minResTime" : 247.0,
    "maxResTime" : 298.0,
    "pct1ResTime" : 298.0,
    "pct2ResTime" : 298.0,
    "pct3ResTime" : 298.0,
    "throughput" : 11.363636363636363,
    "receivedKBytesPerSec" : 11.308149857954545,
    "sentKBytesPerSec" : 2.707741477272727
  },
  "Start Trip" : {
    "transaction" : "Start Trip",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 188.6,
    "medianResTime" : 177.0,
    "minResTime" : 170.0,
    "maxResTime" : 228.0,
    "pct1ResTime" : 228.0,
    "pct2ResTime" : 228.0,
    "pct3ResTime" : 228.0,
    "throughput" : 15.479876160990711,
    "receivedKBytesPerSec" : 15.404290828173375,
    "sentKBytesPerSec" : 3.235052244582043
  },
  "End Trip" : {
    "transaction" : "End Trip",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 184.8,
    "medianResTime" : 194.0,
    "minResTime" : 154.0,
    "maxResTime" : 206.0,
    "pct1ResTime" : 206.0,
    "pct2ResTime" : 206.0,
    "pct3ResTime" : 206.0,
    "throughput" : 16.949152542372882,
    "receivedKBytesPerSec" : 16.866393008474578,
    "sentKBytesPerSec" : 3.509004237288136
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 55,
    "errorCount" : 4,
    "errorPct" : 7.2727275,
    "meanResTime" : 344.8363636363635,
    "medianResTime" : 235.0,
    "minResTime" : 154.0,
    "maxResTime" : 1031.0,
    "pct1ResTime" : 795.1999999999996,
    "pct2ResTime" : 988.9999999999999,
    "pct3ResTime" : 1031.0,
    "throughput" : 13.590313812700765,
    "receivedKBytesPerSec" : 12.016520725228565,
    "sentKBytesPerSec" : 2.6652169044971585
  },
  "Get Code" : {
    "transaction" : "Get Code",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 469.2,
    "medianResTime" : 472.0,
    "minResTime" : 350.0,
    "maxResTime" : 670.0,
    "pct1ResTime" : 670.0,
    "pct2ResTime" : 670.0,
    "pct3ResTime" : 670.0,
    "throughput" : 6.082725060827251,
    "receivedKBytesPerSec" : 3.807643324209246,
    "sentKBytesPerSec" : 0.8553832116788321
  },
  "Create Driver" : {
    "transaction" : "Create Driver",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 256.0,
    "medianResTime" : 274.0,
    "minResTime" : 193.0,
    "maxResTime" : 324.0,
    "pct1ResTime" : 324.0,
    "pct2ResTime" : 324.0,
    "pct3ResTime" : 324.0,
    "throughput" : 11.441647597254004,
    "receivedKBytesPerSec" : 11.385780177345538,
    "sentKBytesPerSec" : 2.7151566075514872
  },
  "Get Trip" : {
    "transaction" : "Get Trip",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 179.6,
    "medianResTime" : 176.0,
    "minResTime" : 155.0,
    "maxResTime" : 197.0,
    "pct1ResTime" : 197.0,
    "pct2ResTime" : 197.0,
    "pct3ResTime" : 197.0,
    "throughput" : 18.115942028985508,
    "receivedKBytesPerSec" : 18.0274852807971,
    "sentKBytesPerSec" : 2.1937273550724634
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 998.0,
    "medianResTime" : 984.0,
    "minResTime" : 983.0,
    "maxResTime" : 1031.0,
    "pct1ResTime" : 1031.0,
    "pct2ResTime" : 1031.0,
    "pct3ResTime" : 1031.0,
    "throughput" : 3.8940809968847354,
    "receivedKBytesPerSec" : 2.563096281152648,
    "sentKBytesPerSec" : 0.8480274045950156
  },
  "Verify" : {
    "transaction" : "Verify",
    "sampleCount" : 5,
    "errorCount" : 4,
    "errorPct" : 80.0,
    "meanResTime" : 587.6,
    "medianResTime" : 606.0,
    "minResTime" : 514.0,
    "maxResTime" : 627.0,
    "pct1ResTime" : 627.0,
    "pct2ResTime" : 627.0,
    "pct3ResTime" : 627.0,
    "throughput" : 6.105006105006105,
    "receivedKBytesPerSec" : 2.9368418040293043,
    "sentKBytesPerSec" : 1.442784645909646
  },
  "Get Driver" : {
    "transaction" : "Get Driver",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 208.2,
    "medianResTime" : 205.0,
    "minResTime" : 179.0,
    "maxResTime" : 245.0,
    "pct1ResTime" : 245.0,
    "pct2ResTime" : 245.0,
    "pct3ResTime" : 245.0,
    "throughput" : 16.339869281045754,
    "receivedKBytesPerSec" : 16.260084763071895,
    "sentKBytesPerSec" : 1.9626991421568627
  }
}