jmeter/jmeter.log
2025-07-11 09:45:22,760 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-07-11 09:45:22,777 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2025-07-11 09:45:22,779 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: Version 5.5
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: java.version=1.8.0_275
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: os.name=Linux
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: os.arch=amd64
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: os.version=6.14.10-orbstack-00291-g1b252bd3edea
2025-07-11 09:45:22,793 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-11 09:45:22,794 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-11 09:45:22,794 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-11 09:45:22,794 INFO o.a.j.JMeter: Available Processors =8
2025-07-11 09:45:22,800 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-11 09:45:22,801 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-07-11 09:45:22,801 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2025-07-11 09:45:22,801 INFO o.a.j.JMeter: user.dir  =/opt/apache-jmeter-5.5
2025-07-11 09:45:22,802 INFO o.a.j.JMeter: PWD       =/opt/apache-jmeter-5.5
2025-07-11 09:45:22,802 INFO o.a.j.JMeter: IP: 192.168.155.7 Name: 3f6ff358b6c3 FullName: 3f6ff358b6c3
2025-07-11 09:45:22,834 INFO o.a.j.s.FileServer: Default base='/opt/apache-jmeter-5.5'
2025-07-11 09:45:22,835 INFO o.a.j.s.FileServer: Set new base='/jmeter'
2025-07-11 09:45:23,010 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-11 09:45:23,128 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-11 09:45:23,134 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-11 09:45:23,139 INFO o.a.j.s.SaveService: Loading file: /jmeter/ride-share-benchmark.jmx
2025-07-11 09:45:23,199 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-11 09:45:23,199 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-11 09:45:23,200 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-11 09:45:23,200 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-11 09:45:23,200 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-11 09:45:23,200 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-11 09:45:24,203 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-11 09:45:24,225 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-11 09:45:24,226 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-11 09:45:24,226 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-11 09:45:24,232 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-11 09:45:24,233 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-11 09:45:24,694 INFO o.a.j.JMeter: Running test (1752219924694)
2025-07-11 09:45:24,756 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Concurrent Users
2025-07-11 09:45:24,757 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Concurrent Users.
2025-07-11 09:45:24,757 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-11 09:45:24,758 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 delayedStart=false
2025-07-11 09:45:24,781 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-1
2025-07-11 09:45:24,814 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-11 09:45:24,814 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-11 09:45:24,836 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 3f6ff358b6c3
2025-07-11 09:45:24,855 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-07-11 09:45:24,857 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-07-11 09:45:24,857 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-07-11 09:45:24,857 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-07-11 09:45:24,857 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-07-11 09:45:24,974 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-2
2025-07-11 09:45:25,186 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-3
2025-07-11 09:45:25,382 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-4
2025-07-11 09:45:25,561 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-5
2025-07-11 09:45:27,178 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-1
2025-07-11 09:45:27,178 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-1
2025-07-11 09:45:27,189 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-2
2025-07-11 09:45:27,189 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-2
2025-07-11 09:45:27,251 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-3
2025-07-11 09:45:27,252 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-3
2025-07-11 09:45:27,313 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-4
2025-07-11 09:45:27,313 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-4
2025-07-11 09:45:27,354 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-5
2025-07-11 09:45:27,354 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-5
2025-07-11 09:45:27,355 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-11 09:45:27,357 INFO o.a.j.r.Summariser: summary =     55 in 00:00:03 =   20.7/s Avg:   182 Min:    69 Max:   495 Err:     4 (7.27%)