jmeter/jmeter.log
2025-06-27 08:34:06,631 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-06-27 08:34:06,650 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2025-06-27 08:34:06,652 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2025-06-27 08:34:06,694 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: Version 5.5
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: java.version=1.8.0_275
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: os.name=Linux
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: os.arch=amd64
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: os.version=6.14.10-orbstack-00291-g1b252bd3edea
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: java.awt.headless=true
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: Max memory     =1073741824
2025-06-27 08:34:06,695 INFO o.a.j.JMeter: Available Processors =8
2025-06-27 08:34:06,708 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-06-27 08:34:06,711 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-06-27 08:34:06,713 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2025-06-27 08:34:06,714 INFO o.a.j.JMeter: user.dir  =/opt/apache-jmeter-5.5
2025-06-27 08:34:06,714 INFO o.a.j.JMeter: PWD       =/opt/apache-jmeter-5.5
2025-06-27 08:34:06,715 INFO o.a.j.JMeter: IP: 192.168.155.7 Name: 1ac50ed63b80 FullName: 1ac50ed63b80
2025-06-27 08:34:06,773 INFO o.a.j.s.FileServer: Default base='/opt/apache-jmeter-5.5'
2025-06-27 08:34:06,778 INFO o.a.j.s.FileServer: Set new base='/jmeter'
2025-06-27 08:34:07,136 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-06-27 08:34:07,329 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-06-27 08:34:07,336 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-06-27 08:34:07,344 INFO o.a.j.s.SaveService: Loading file: /jmeter/ride-share-benchmark.jmx
2025-06-27 08:34:07,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-06-27 08:34:07,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-06-27 08:34:07,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-06-27 08:34:07,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-06-27 08:34:07,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-06-27 08:34:07,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-06-27 08:34:08,541 INFO o.a.j.JMeter: Creating summariser <summary>
2025-06-27 08:34:08,586 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-06-27 08:34:08,588 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-06-27 08:34:08,588 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-06-27 08:34:08,597 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-06-27 08:34:08,597 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-06-27 08:34:09,437 INFO o.a.j.JMeter: Running test (1751006049437)
2025-06-27 08:34:09,524 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Concurrent Users
2025-06-27 08:34:09,527 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Concurrent Users.
2025-06-27 08:34:09,527 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-06-27 08:34:09,531 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 delayedStart=false
2025-06-27 08:34:09,676 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-1
2025-06-27 08:34:09,742 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-06-27 08:34:09,744 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-06-27 08:34:09,804 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 1ac50ed63b80
2025-06-27 08:34:09,830 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-06-27 08:34:09,832 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-06-27 08:34:09,832 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-06-27 08:34:09,832 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-06-27 08:34:09,832 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-06-27 08:34:09,847 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-2
2025-06-27 08:34:10,048 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-3
2025-06-27 08:34:10,244 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-4
2025-06-27 08:34:10,364 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-5
2025-06-27 08:34:14,043 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-1
2025-06-27 08:34:14,054 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-1
2025-06-27 08:34:14,135 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-2
2025-06-27 08:34:14,136 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-2
2025-06-27 08:34:14,146 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-3
2025-06-27 08:34:14,146 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-3
2025-06-27 08:34:14,150 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-4
2025-06-27 08:34:14,151 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-4
2025-06-27 08:34:14,165 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-5
2025-06-27 08:34:14,166 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-5
2025-06-27 08:34:14,168 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-06-27 08:34:14,172 INFO o.a.j.r.Summariser: summary =     55 in 00:00:05 =   11.6/s Avg:   344 Min:   154 Max:  1031 Err:     4 (7.27%)